# IsPrimary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPConnectorInfo..::..IsPrimary Property
MEPConnectorInfo Class See Also
---
True if this is the primary connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsPrimary { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPrimary As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPrimary {
	bool get ();
}
```

# See Also
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace